loadtest.yaml
config:
  target: https://98y98340923u4.com
  phases:
    - duration: 600
      arrivalRate: 10
  processor: "./loadtest.js"

scenarios:
  - name: "HTTP Request and WebSocket Connection"
    flow:
      - get:
          url: "/set-cookie"
      - function: "establishWebSocketConnection"
      - think: 600